import 'package:places/domain/sight.dart';

final List mocks = [
  Sight(
    name: 'Озеро Байкал (Иркутская область, Иркутск)',
    lat: 51.90503,
    lon: 126.62002,
    url: 'https://img.gazeta.ru/files3/345/6693345/Ice-on-Lake-Baikal-pic700-700x467-66269.jpg',
    details: 'озеро тектонического происхождения в южной части Восточной Сибири, самое глубокое озеро на планете, крупнейший природный резервуар пресной воды и самое большое по площади пресноводное озеро на континенте.',
    type: 'Достопримечательность'),
  Sight(
    name: 'White Rabbit',
    lat: 55.7475260,
    lon: 37.5814870,
    url: 'https://frade-msk.ru/wp-content/uploads/2019/05/restorany-moskvy-s-panoramnym-vidom-2.jpg',
    details: 'Панорамный ресторан в историческом центре Москвы авторская кухня. Шеф - повар Владимир Мухин ' ,
    type: 'Ресторан',
  ),
  Sight(
    name: 'Эрмитаж',
    lat: 59.939848,
    lon: 30.314568,
    url: 'https://b1.culture.ru/c/75570.688x392.jpg',
    details: '3 миллиона произведений. 20 километров шедевров. А начинался Эрмитаж как частное собрание Екатерины II из 225 картин. Увидеть его могли лишь избранные, получив билет в дворцовой конторе и облачившись во фрак или мундир. ' ,
    type: 'Музей',
  ),
];